// =============================================== задача 1 ===============================================
// Напишите скрипт который реализует следующий функционал.
// Есть кнопка с классом button, текст которой отображает кол-во раз которое по ней кликнули, обновляется при каждом клике.

// const button = document.querySelector('.button');
// let text = +button.textContent;
// button.addEventListener('click', function () {
//     button.textContent = text;
//     text += 1;
// });

// =============================================== задача 2 ===============================================
// Даны 2 инпута, абзац и кнопка. По нажатию на кнопку получите числа стоящие в инпутах и запишите их сумму в абзац.


// =============================================== задача 3 ===============================================
// =============================================== задача 4 ===============================================
// =============================================== задача 5 ===============================================
// =============================================== задача 6 ===============================================
// =============================================== задача 7 ===============================================
// =============================================== задача 8 ===============================================











