'use strict';
// ===============================================  Задача 1  ==========================================================
/*
  Есть массив имен пользователей. В первом console.log вывести длину массива.
  В последующих console.log дополнить конструкцию так, чтобы в консоль вывелись указаные в комментариях элементы массива.
*/
// const users = ['Mango', 'Poly', 'Ajax', 'Chelsey'];
// console.log(users.length); // 4
// console.log(users[1]); // Poly
// console.log(users[3]); // Chelsey
// console.log(users[0]); // Mango
// console.log(users[2]); // Ajax
// ===============================================  Задача 2  ==========================================================
/* Есть массив имен пользователей */
// const users = ["Mango", "Poly", "Ajax", "Chelsey"];
// /* Используя методы массива, последовательно выполнить следующие операции */
// // Удалить из начала массива нулевой элемент
// users.shift();
// console.log(users); // ["Poly", "Ajax", "Chelsey"]
//
// // Удалить из конца массив последний элемент
// users.pop();
// console.log(users); // ["Poly", "Ajax"]
//
// // Добавить в начало массива любое имя
// users.unshift('Dima');
// console.log(users); // ["добавленое имя", "Poly", "Ajax"]
//
// // Добавить в конец массива два любых имени за одну операцию
// users.push('Den', 'Max');
// console.log(users); //  ["добавленое ранее имя", "Poly", "Ajax", "имя 1", "имя 2"]
// ===============================================  Задача 3  ==========================================================
/*
  Попросить пользователя ввести произвольную строкуи записать ее в переменную string
  PS: для перебора массива используте цикл for или for...of
*/
let string = prompt('введите что нибудь');
let arr;
// Разбить строку в массив, пусть разделителем будет пробел, и записать в переменную arr
string =
console.log();

// Вывести в консоли общую длину массива arr
console.log();

// Используя цикл, вывести в консоль все индексы массива arr
console.log();

// Используя цикл, вывести в консоль все элементы массива arr
console.log();

// Используя цикл, bывести в консоли все пары индекс:значение массива arr
console.log();

// ===============================================  Задача 4  ==========================================================
// ===============================================  Задача 5  ==========================================================
// ===============================================  Задача 6  ==========================================================
// ===============================================  Задача 7  ==========================================================
// ===============================================  Задача 8  ==========================================================
// ===============================================  Задача 9  ==========================================================
